app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = 'kozak@gmail.com'
 LIMIT 1
---
    public function authenticate($email, $password)
    {
        $user = $this->where('email', $email)->first();